GUdaoxi/demo_qspi/LPTIM16_Timing/Drivers/FM33FH0xx_FL_Driver/Src/fm33fh0xx_fl_atim.c
/**
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_atim.c
  * @author  FMSH Application Team
  * @brief   Src file of ATIM FL Module
  *******************************************************************************************************
  * @attention
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  *******************************************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "fm33fh0xx_fl.h"

/** @addtogroup FM33FH0xx_FL_Driver
  * @{
  */

/** @addtogroup ATIM
  * @{
  */

#ifdef FL_ATIM_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------*/
/** @addtogroup ATIM_FL_Private_Macros
  * @{
  */


#define IS_ATIM_INSTANCE(TIMx)                     ((TIMx) == ATIM)



#define IS_FL_ATIM_COUNTERMODE(__VALUE__)          (((__VALUE__) == FL_ATIM_COUNTER_DIR_UP) \
                                                    || ((__VALUE__) == FL_ATIM_COUNTER_DIR_DOWN) \
                                                    || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_DOWN   ) \
                                                    || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_UP     ) \
                                                    || ((__VALUE__) == FL_ATIM_COUNTER_ALIGNED_CENTER_UP_DOWN))

#define IS_FL_ATIM_CLOCKDIVISION(__VALUE__)        (((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV1) \
                                                    || ((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV2) \
                                                    || ((__VALUE__) == FL_ATIM_CLK_DIVISION_DIV4))


#define IS_FL_ATIM_CC_MODE(__VALUE__)               (((__VALUE__) ==   FL_ATIM_CHANNEL_MODE_OUTPUT) \
                                                     || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_NORMAL) \
                                                     || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_CROSSOVER) \
                                                     || ((__VALUE__) == FL_ATIM_CHANNEL_MODE_INPUT_TRC))

#define IS_FL_ATIM_IC_FILTER(__VALUE__)            (((__VALUE__) == FL_ATIM_IC_FILTER_DIV1 ) \
                                                    || ((__VALUE__) ==FL_ATIM_IC_FILTER_DIV1_N2) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV1_N4) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV1_N8) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV2_N6) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV2_N8) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV4_N6) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV4_N8) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV8_N6) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV8_N8) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N5) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N6) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV16_N8) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N5) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N6) \
                                                    || ((__VALUE__) == FL_ATIM_IC_FILTER_DIV32_N8))

#define IS_FL_ATIM_CHANNEL(__VALUE__)              (((__VALUE__) == FL_ATIM_CHANNEL_1)\
                                                    || ((__VALUE__) == FL_ATIM_CHANNEL_2)\
                                                    || ((__VALUE__) == FL_ATIM_CHANNEL_3)\
                                                    || ((__VALUE__) == FL_ATIM_CHANNEL_4)\
                                                    || ((__VALUE__) == FL_ATIM_CHANNEL_5)\
                                                    || ((__VALUE__) == FL_ATIM_CHANNEL_6))



#define IS_FL_ATIM_SLAVE_MODE(__VALUE__)           (((__VALUE__) == FL_ATIM_SLAVE_MODE_PROHIBITED)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X1_TI1)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X2_TI2)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_ENCODER_X4_TI1TI2)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_RISE_RST)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_HIGH_RUN)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_TRGI_RISE_RUN)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_EXT_MODE1)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_COMBINED_RESETTRIGGER)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_COMBINED_GATEDRESET)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_CLOCKPLUSDIRECTION_X2)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_CLOCKPLUSDIRECTION_X1)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_DIRECTIONALCLOCK_X2)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_DIRECTIONALCLOCK_X1)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_X1_TI1)\
                                                    || ((__VALUE__) == FL_ATIM_SLAVE_MODE_X1_TI2))


#define IS_FL_ATIM_TRIGGER_SRC(__VALUE__)          (((__VALUE__) == FL_ATIM_TRGI_ITR0 )\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR1 )\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR2)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR3)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_TI1F_EDGE)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_TI1FP1)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_TI2FP2)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ETRF)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR4)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR5)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR6)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR7)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR8)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR9)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR10)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR11)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR12)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR13)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR14)\
                                                    ||((__VALUE__) ==FL_ATIM_TRGI_ITR15))



#define IS_FL_ATIM_ETP_FILTER(__VALUE__)           (((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N2) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N4) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV1_N8) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV2_N6) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV2_N8) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV4_N6) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV4_N8) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV8_N6) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV8_N8) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N5) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N6) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV16_N8) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N5) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N6) \
                                                    || ((__VALUE__) == FL_ATIM_ETR_FILTER_DIV32_N8))


